Revit 2027 API
AnalysisDisplayColorSettings.IsEqual Method
 Compares two color settings objects.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsEqual(
	AnalysisDisplayColorSettings other
)
Public Function IsEqual (
	other As AnalysisDisplayColorSettings
) As Boolean
public:
bool IsEqual(
	AnalysisDisplayColorSettings^ other
)
member IsEqual :
        other : AnalysisDisplayColorSettings -> bool
Parameters
other AnalysisDisplayColorSettings
 Color settings object to compare to.
Return Value
Boolean
 True if objects are equal, false otherwise.
See Also
Reference
AnalysisDisplayColorSettings Class
Autodesk.Revit.DB.Analysis Namespace